biddr_api/app/controllers/application_controller.rb

  def current_user
    if session[:user_id].present?
      @current_user ||= User.find session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]