biddr_api/app/controllers/auctions_controller.rb

    def show
        @bid=Bid.new
        @bids=@auction.bids.order(created_at: :desc)
---
SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1 ORDER BY "bids"."created_at" DESC  [["auction_id", 1]]

    def find_auction
        @auction=Auction.find params[:id]
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]