biddr_api/app/controllers/bids_controller.rb

    def create
        @auction = Auction.find(params[:auction_id])
        @bid = Bid.new bid_params
        # @bid.user = current_user
        @bid.auction = @auction
        if @bid.save
          redirect_to auction_path(@auction)
        else
          @bids = @auction.bids.order(offer: :DESC)
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1 ORDER BY "bids"."offer" DESC  [["auction_id", 1]]