biddr_api/app/controllers/api/v1/bids_controller.rb

    def create
        @auction=Auction.find params[:auction_id]
        bid=Bid.new params.require(:bid).permit(:offer);
        bid.auction=@auction
        bid.user=current_user
        if bid.save
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "bids" ("offer", "auction_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["offer", 12.0], ["auction_id", 7], ["created_at", "2021-03-02 18:16:08.704450"], ["updated_at", "2021-03-02 18:16:08.704450"], ["user_id", 1]]