biddr_api/app/controllers/api/v1/users_controller.rb

    def create
        user = User.new params.require(:user).permit(
          :name,
          :email,
          :password,
          :password_confirmation
        )
        if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"